{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "finetuning_task": "naver-ner",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "UNK",
    "1": "O",
    "10": "LOC-B",
    "11": "LOC-I",
    "12": "CVL-B",
    "13": "CVL-I",
    "14": "DAT-B",
    "15": "DAT-I",
    "16": "TIM-B",
    "17": "TIM-I",
    "18": "NUM-B",
    "19": "NUM-I",
    "2": "PER-B",
    "20": "EVT-B",
    "21": "EVT-I",
    "22": "ANM-B",
    "23": "ANM-I",
    "24": "PLT-B",
    "25": "PLT-I",
    "26": "MAT-B",
    "27": "MAT-I",
    "28": "TRM-B",
    "29": "TRM-I",
    "3": "PER-I",
    "4": "FLD-B",
    "5": "FLD-I",
    "6": "AFW-B",
    "7": "AFW-I",
    "8": "ORG-B",
    "9": "ORG-I"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "AFW-B": 6,
    "AFW-I": 7,
    "ANM-B": 22,
    "ANM-I": 23,
    "CVL-B": 12,
    "CVL-I": 13,
    "DAT-B": 14,
    "DAT-I": 15,
    "EVT-B": 20,
    "EVT-I": 21,
    "FLD-B": 4,
    "FLD-I": 5,
    "LOC-B": 10,
    "LOC-I": 11,
    "MAT-B": 26,
    "MAT-I": 27,
    "NUM-B": 18,
    "NUM-I": 19,
    "O": 1,
    "ORG-B": 8,
    "ORG-I": 9,
    "PER-B": 2,
    "PER-I": 3,
    "PLT-B": 24,
    "PLT-I": 25,
    "TIM-B": 16,
    "TIM-I": 17,
    "TRM-B": 28,
    "TRM-I": 29,
    "UNK": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "type_vocab_size": 2,
  "vocab_size": 8002
}
